N=int(input())
i=2
while N%i!=0:
    i+=1
print(i)



"""Дано целое число 𝑁, не меньшее 2. 
Выведите его наименьший натуральный делитель, отличный от 1."""