N=int(input())
p=1
while p<N:
    p*=2
print("YES" if p==N else "NO")



"""Дано натуральное число N. Выведите слово YES, если число N является точной степенью двойки, 
или слово NO в противном случае.
"""